driver-tests/jdbcbc/DB2/jdbcbc61_DB2_JBI/test/JDBCUpdateOneRec_Invoke/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tab="http://j2ee.netbeans.org/xsd/tableSchema">
  <soapenv:Body>
    <tab:JDBCOUTBOUNDDRIVERTEST_EMP>
      <tab:EMPID>100</tab:EMPID>
      <tab:DEPTID>200</tab:DEPTID>
      <tab:MARKCOLUMN>0</tab:MARKCOLUMN>
      <tab:ENAME>Rohan</tab:ENAME>
    </tab:JDBCOUTBOUNDDRIVERTEST_EMP>
  </soapenv:Body>
</soapenv:Envelope>